XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Cmsemicon.CMS32-Series.pdsc
				<device Dname="CMS32M5710">
					<processor Dclock="64000000"/>
					<description>   
Core
 - ARM Cortex-M0 core runs up to 64 MHz
 - One 24-bit system timer
 - Supports low power Sleep/Deep sleep/Stop Mode
 - A single-cycle 32-bit hardware multiplier
 - A six-cycles 32-bit hardware divider
Memory
 - 64KB Flash memory for program memory and boot
 - Independent 1KB Flash memory for data memory
 - 8KB SRAM for internal scratch-pad RAM (SRAM)
In-System Programming (ISP) &amp; In-Application Programming (IAP) &amp; In-Circuit Programming (ICP)
Clock Control
 - Programmable system clock source
 - 48/64 MHz internal oscillator (HIRC) (1% accuracy at 25'C, 2.1 V to 5.5 V)
 - 40 KHz internal low-power oscillator (LIRC) for watchdog and idle wakeup
I/O Port
 - Up to 30 General Purpose I/O (GPIO) pins
Timer
 - Four 16/32-bit Timers with 3-levels pre-scaler
Watchdog Timer &amp; Window Watchdog Timer
 - Programmable clock source and timeout period
EPWM
 - Built-in enhanced PWM, up to six channels
CCP
 - Two groups CCP(Capture/Compare/PWM)
UART
 - Two UART devices
SPI
 - One SPI device
I2C
 - One I2C device
ADC0
 - 12-bit SAR ADC with 100KSPS
ADC1
 - 12-bit SAR ADC with 1.2MSPS
Analog Comparator
 - Two analog comparators
Programmable Gain Amplifier
 - Two programmable gain amplifiers
Operation Amplifier
 - Two operation amplifiers
Temperature sensor
 - Built-in high precision temperature sensor
LVR
 - Programmable 3 threshold levels: 1.9V/2.1V/2.6V
LVD
 - Programmable 6 threshold levels: 2.0V/2.2V/2.4V/2.7V/3.0V/3.7V
96-bit unique ID
128-bit user ID
                    </description>
					<compile header="Device/CMS32M57xx/Include/CMS32M57xx.h" define="CMS32M57xx"/>
					<debug svd="SVD/CMS32M57xx.svd"/>
					<memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
					<algorithm name="Flash/CMS32M57xx.FLM" start="0x00000000" size="0x10000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				</device>
					<device Dname="CMS32M5717">
					<processor Dclock="64000000"/>
					<description>   
Core
 - ARM Cortex-M0 core runs up to 64 MHz
 - One 24-bit system timer
 - Supports low power Sleep/Deep sleep/Stop Mode
 - A single-cycle 32-bit hardware multiplier
 - A six-cycles 32-bit hardware divider
Memory
 - 64KB Flash memory for program memory and boot
 - Independent 1KB Flash memory for data memory
 - 8KB SRAM for internal scratch-pad RAM (SRAM)
In-System Programming (ISP) &amp; In-Application Programming (IAP) &amp; In-Circuit Programming (ICP)
Clock Control
 - Programmable system clock source
 - 48/64 MHz internal oscillator (HIRC) (1% accuracy at 25'C, 2.1 V to 5.5 V)
 - 40 KHz internal low-power oscillator (LIRC) for watchdog and idle wakeup
I/O Port
 - Up to 30 General Purpose I/O (GPIO) pins
Timer
 - Four 16/32-bit Timers with 3-levels pre-scaler
Watchdog Timer &amp; Window Watchdog Timer
 - Programmable clock source and timeout period
EPWM
 - Built-in enhanced PWM, up to six channels
CCP
 - Two groups CCP(Capture/Compare/PWM)
UART
 - Two UART devices
SPI
 - One SPI device
I2C
 - One I2C device
ADC0
 - 12-bit SAR ADC with 100KSPS
ADC1
 - 12-bit SAR ADC with 1.2MSPS
Analog Comparator
 - Two analog comparators
Programmable Gain Amplifier
 - Two programmable gain amplifiers
Operation Amplifier
 - Two operation amplifiers
Temperature sensor
 - Built-in high precision temperature sensor
LVR
 - Programmable 3 threshold levels: 1.9V/2.1V/2.6V
LVD
 - Programmable 6 threshold levels: 2.0V/2.2V/2.4V/2.7V/3.0V/3.7V
96-bit unique ID
128-bit user ID
                    </description>
					<compile header="Device/CMS32M57xx/Include/CMS32M57xx.h" define="CMS32M57xx"/>
					<debug svd="SVD/CMS32M57xx.svd"/>
					<memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
					<algorithm name="Flash/CMS32M57xx.FLM" start="0x00000000" size="0x10000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				</device>
				<device Dname="CMS32M5733">
					<processor Dclock="64000000"/>
					<description>   
Core
 - ARM Cortex-M0 core runs up to 64 MHz
 - One 24-bit system timer
 - Supports low power Sleep/Deep sleep/Stop Mode
 - A single-cycle 32-bit hardware multiplier
 - A six-cycles 32-bit hardware divider
Memory
 - 64KB Flash memory for program memory and boot
 - Independent 1KB Flash memory for data memory
 - 8KB SRAM for internal scratch-pad RAM (SRAM)
In-System Programming (ISP) &amp; In-Application Programming (IAP) &amp; In-Circuit Programming (ICP)
Clock Control
 - Programmable system clock source
 - 48/64 MHz internal oscillator (HIRC) (1% accuracy at 25'C, 2.1 V to 5.5 V)
 - 40 KHz internal low-power oscillator (LIRC) for watchdog and idle wakeup
I/O Port
 - Up to 30 General Purpose I/O (GPIO) pins
Timer
 - Four 16/32-bit Timers with 3-levels pre-scaler
Watchdog Timer &amp; Window Watchdog Timer
 - Programmable clock source and timeout period
EPWM
 - Built-in enhanced PWM, up to six channels
CCP
 - Two groups CCP(Capture/Compare/PWM)
UART
 - Two UART devices
SPI
 - One SPI device
I2C
 - One I2C device
ADC0
 - 12-bit SAR ADC with 100KSPS
ADC1
 - 12-bit SAR ADC with 1.2MSPS
Analog Comparator
 - Two analog comparators
Programmable Gain Amplifier
 - Two programmable gain amplifiers
Operation Amplifier
 - Two operation amplifiers
Temperature sensor
 - Built-in high precision temperature sensor
LVR
 - Programmable 3 threshold levels: 1.9V/2.1V/2.6V
LVD
 - Programmable 6 threshold levels: 2.0V/2.2V/2.4V/2.7V/3.0V/3.7V
96-bit unique ID
128-bit user ID
                    </description>
					<compile header="Device/CMS32M57xx/Include/CMS32M57xx.h" define="CMS32M57xx"/>
					<debug svd="SVD/CMS32M57xx.svd"/>
					<memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1"/>
					<memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
					<algorithm name="Flash/CMS32M57xx.FLM" start="0x00000000" size="0x10000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				</device>
                <device Dname="CMS32M5736">
                    <processor Dclock="64000000"/>
                    <description>   
Core
 - ARM Cortex-M0 core runs up to 64 MHz
 - One 24-bit system timer
 - Supports low power Sleep/Deep sleep/Stop Mode
 - A single-cycle 32-bit hardware multiplier
 - A six-cycles 32-bit hardware divider
Memory
 - 64KB Flash memory for program memory and boot
 - Independent 1KB Flash memory for data memory
 - 8KB SRAM for internal scratch-pad RAM (SRAM)
In-System Programming (ISP) &amp; In-Application Programming (IAP) &amp; In-Circuit Programming (ICP)
Clock Control
 - Programmable system clock source
 - 48/64 MHz internal oscillator (HIRC) (1% accuracy at 25'C, 2.1 V to 5.5 V)
 - 40 KHz internal low-power oscillator (LIRC) for watchdog and idle wakeup
I/O Port
 - Up to 30 General Purpose I/O (GPIO) pins
Timer
 - Four 16/32-bit Timers with 3-levels pre-scaler
Watchdog Timer &amp; Window Watchdog Timer
 - Programmable clock source and timeout period
EPWM
 - Built-in enhanced PWM, up to six channels
CCP
 - Two groups CCP(Capture/Compare/PWM)
UART
 - Two UART devices
SPI
 - One SPI device
I2C
 - One I2C device
ADC0
 - 12-bit SAR ADC with 100KSPS
ADC1
 - 12-bit SAR ADC with 1.2MSPS
Analog Comparator
 - Two analog comparators
Programmable Gain Amplifier
 - Two programmable gain amplifiers
Operation Amplifier
 - Two operation amplifiers
Temperature sensor
 - Built-in high precision temperature sensor
LVR
 - Programmable 3 threshold levels: 1.9V/2.1V/2.6V
LVD
 - Programmable 6 threshold levels: 2.0V/2.2V/2.4V/2.7V/3.0V/3.7V
96-bit unique ID
128-bit user ID
                    </description>
                    <compile header="Device/CMS32M57xx/Include/CMS32M57xx.h" define="CMS32M57xx"/>
                    <debug svd="SVD/CMS32M57xx.svd"/>
                    <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash/CMS32M57xx.FLM" start="0x00000000" size="0x10000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
                </device>
                <device Dname="CMS32MEBIKE">
                    <processor Dclock="64000000"/>
                    <description>   
Core
 - ARM Cortex-M0 core runs up to 64 MHz
 - One 24-bit system timer
 - Supports low power Sleep/Deep sleep/Stop Mode
 - A single-cycle 32-bit hardware multiplier
 - A six-cycles 32-bit hardware divider
Memory
 - 64KB Flash memory for program memory and boot
 - Independent 1KB Flash memory for data memory
 - 8KB SRAM for internal scratch-pad RAM (SRAM)
In-System Programming (ISP) &amp; In-Application Programming (IAP) &amp; In-Circuit Programming (ICP)
Clock Control
 - Programmable system clock source
 - 48/64 MHz internal oscillator (HIRC) (1% accuracy at 25'C, 2.1 V to 5.5 V)
 - 40 KHz internal low-power oscillator (LIRC) for watchdog and idle wakeup
Timer
 - Four 16/32-bit Timers with 3-levels pre-scaler
Watchdog Timer &amp; Window Watchdog Timer
 - Programmable clock source and timeout period
EPWM
 - Built-in enhanced PWM up to four channels
CCP
 - Two groups CCP(Capture/Compare/PWM)
UART
 - Two UART devices
SPI
 - One SPI device
I2C
 - One I2C device
ADC0
 - 12-bit SAR ADC with 100KSPS
ADC1
 - 12-bit SAR ADC with 1.2MSPS
Analog Comparator
 - Two analog comparators
Programmable Gain Amplifier
 - Two programmable gain amplifiers
Operation Amplifier
 - Two operation amplifiers
Temperature sensor
 - Built-in high precision temperature sensor
LVR
 - Programmable 3 threshold levels: 1.9V/2.1V/2.6V
LVD
 - Programmable 6 threshold levels: 2.0V/2.2V/2.4V/2.7V/3.0V/3.7V
96-bit unique ID
128-bit user ID
            </description>
                    <feature type="UART" n="2"/>
                    <feature type="I2C" n="1"/>
                    <feature type="SPI" n="1"/>
                    <feature type="Timer" n="2" m="32"/>
                    <feature type="ADC" n="8" m="10"/>
                    <compile header="Device/CMS32MEBIKE/Include/CMS32MEBIKE.h" define="CMS32MEBIKE"/>
                    <debug svd="SVD/CMS32MEBIKE.svd"/>
                    <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash/CMS32MEBIKE.FLM" start="0x00000000" size="0x10000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
                </device>
			</subFamily>
		</family>
	</devices>
	<conditions>
		<!-- conditions are dependency rules that can apply to a component or an individual file -->
		<condition id="Startup ARM">
			<description>Startup assembler file for ARMCC</description>
			<require Tcompiler="ARMCC"/>
		</condition>
