XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Cmsemicon.CMS32-Series.pdsc
		<condition id="CMS32 Series CMSIS-CORE">
			<description>CMS CMS32 Series devices and CMSIS-CORE and ARMCC compiler</description>
			<require condition="Startup ARM"/>
			<require Cclass="CMSIS" Cgroup="CORE"/>
			<require Dvendor="Cmsemicon:161" DsubFamily="CMS32 Series"/>
		</condition>
		<condition id="CMS32F030 CMSIS-CORE">
			<description> CMS32F030 and CMSIS-CORE and ARMCC compiler</description>
			<require condition="CMS32 Series CMSIS-CORE"/>
			<accept Dname="CMS32F030"/>
		</condition>
		<condition id="CMS32F033 CMSIS-CORE">
			<description> CMS32F033 and CMSIS-CORE and ARMCC compiler</description>
			<require condition="CMS32 Series CMSIS-CORE"/>
			<accept Dname="CMS32F033"/>
		</condition>
		<condition id="CMS32F035 CMSIS-CORE">
			<description> CMS32F035 and CMSIS-CORE and ARMCC compiler</description>
			<require condition="CMS32 Series CMSIS-CORE"/>
			<accept Dname="CMS32F035"/>
		</condition>
		<condition id="CMS32M53xx CMSIS-CORE">
			<description> CMS32M53xx and CMSIS-CORE and ARMCC compiler</description>
			<require condition="CMS32 Series CMSIS-CORE"/>
			<accept Dname="CMS32M5310"/>
			<accept Dname="CMS32M5332"/>
			<accept Dname="CMS32M5333"/>
            <accept Dname="CMS32M5336"/>
		</condition>
		<condition id="CMS32M55xx CMSIS-CORE">
			<description> CMS32M55xx and CMSIS-CORE and ARMCC compiler</description>
			<require condition="CMS32 Series CMSIS-CORE"/>
			<accept Dname="CMS32M5510"/>
            <accept Dname="CMS32M5512"/>
			<accept Dname="CMS32M5533"/>
			<accept Dname="CMS32M5524"/>
		</condition>
		<condition id="CMS32M57xx CMSIS-CORE">
			<description> CMS32M57xx and CMSIS-CORE and ARMCC compiler</description>
			<require condition="CMS32 Series CMSIS-CORE"/>
			<accept Dname="CMS32M5710"/>
			<accept Dname="CMS32M5733"/>
            <accept Dname="CMS32M5736"/>
		</condition>
        <condition id="CMS32MEBIKE CMSIS-CORE">
            <description> CMS32F035 and CMSIS-CORE and ARMCC compiler</description>
            <require condition="CMS32 Series CMSIS-CORE"/>
            <accept Dname="CMS32MEBIKE"/>
        </condition>
	</conditions>
	<components>
		<!-- Startup CMS32F030 -->
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="CMS32F030 CMSIS-CORE">
			<!-- Cversion is necessary -->
			<description>System Startup for CMS CMS32F030 Series</description>
			<!--RTE_Components_h>
                #define RTE_DEVICE_STARTUP_CMS32F030     /* Device Startup for CMS32F030 */
            </RTE_Components_h-->
			<files>
				<!-- include folder -->
				<file category="include" name="Device/CMS32F030/Include/"/>
				<file category="header" name="Device/CMS32F030/Include/CMS32F030.h"/>
				<!-- startup files -->
				<file category="source" name="Device/CMS32F030/Source/ARM/startup_CMS32F030.s" attr="config" condition="Startup ARM" version="1.0.0"/>
				<!-- system file -->
				<file category="source" name="Device/CMS32F030/Source/system_CMS32F030.c" attr="config" version="1.0.0"/>
				<!-- device configuration required by drivers at the moment -->
			</files>
		</component>
		<!-- Startup CMS32F033 -->
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="CMS32F033 CMSIS-CORE">
			<!-- Cversion is necessary -->
			<description>System Startup for CMS CMS32F033 Series</description>
			<!--RTE_Components_h>
                #define RTE_DEVICE_STARTUP_CMS32F033     /* Device Startup for CMS32F033 */
            </RTE_Components_h-->
			<files>
				<!-- include folder -->
				<file category="include" name="Device/CMS32F033/Include/"/>
				<file category="header" name="Device/CMS32F033/Include/CMS32F033.h"/>
				<!-- startup files -->
				<file category="source" name="Device/CMS32F033/Source/ARM/startup_CMS32F033.s" attr="config" condition="Startup ARM" version="1.0.0"/>
				<!-- system file -->
				<file category="source" name="Device/CMS32F033/Source/system_CMS32F033.c" attr="config" version="1.0.0"/>
				<!-- device configuration required by drivers at the moment -->
			</files>
		</component>
		<!-- Startup CMS32F035 -->
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="CMS32F035 CMSIS-CORE">
			<!-- Cversion is necessary -->
			<description>System Startup for CMS CMS32F035 Series</description>
			<!--RTE_Components_h>
                #define RTE_DEVICE_STARTUP_CMS32F035     /* Device Startup for CMS32F035 */
            </RTE_Components_h-->
			<files>
				<!-- include folder -->
				<file category="include" name="Device/CMS32F035/Include/"/>
				<file category="header" name="Device/CMS32F035/Include/CMS32F035.h"/>
				<!-- startup files -->
				<file category="source" name="Device/CMS32F035/Source/ARM/startup_CMS32F035.s" attr="config" condition="Startup ARM" version="1.0.0"/>
				<!-- system file -->
				<file category="source" name="Device/CMS32F035/Source/system_CMS32F035.c" attr="config" version="1.0.0"/>
				<!-- device configuration required by drivers at the moment -->
			</files>
		</component>
		<!-- Startup CMS32M53xx -->
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="CMS32M53xx CMSIS-CORE">
			<!-- Cversion is necessary -->
			<description>System Startup for CMS CMS32M53xx Series</description>
			<!--RTE_Components_h>
                #define RTE_DEVICE_STARTUP_CMS32M55xx     /* Device Startup for CMS32M55xx */
            </RTE_Components_h-->
			<files>
				<!-- include folder -->
				<file category="include" name="Device/CMS32M53xx/Include/"/>
				<file category="header" name="Device/CMS32M53xx/Include/CMS32M53xx.h"/>
				<!-- startup files -->
				<file category="source" name="Device/CMS32M53xx/Source/ARM/startup_CMS32M53xx.s" attr="config" condition="Startup ARM" version="1.0.0"/>
				<!-- system file -->
				<file category="source" name="Device/CMS32M53xx/Source/system_CMS32M53xx.c" attr="config" version="1.0.0"/>
				<!-- device configuration required by drivers at the moment -->
			</files>
		</component>
		<!-- Startup CMS32M55xx -->
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="CMS32M55xx CMSIS-CORE">
			<!-- Cversion is necessary -->
			<description>System Startup for CMS CMS32M55xx Series</description>
			<!--RTE_Components_h>
                #define RTE_DEVICE_STARTUP_CMS32M55xx     /* Device Startup for CMS32M55xx */
            </RTE_Components_h-->
			<files>
				<!-- include folder -->
				<file category="include" name="Device/CMS32M55xx/Include/"/>
				<file category="header" name="Device/CMS32M55xx/Include/CMS32M55xx.h"/>
				<!-- startup files -->
				<file category="source" name="Device/CMS32M55xx/Source/ARM/startup_CMS32M55xx.s" attr="config" condition="Startup ARM" version="1.0.0"/>
				<!-- system file -->
				<file category="source" name="Device/CMS32M55xx/Source/system_CMS32M55xx.c" attr="config" version="1.0.0"/>
				<!-- device configuration required by drivers at the moment -->
			</files>
		</component>
