XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Cmsemicon.CMS32-Series.pdsc
		<!-- Startup CMS32M57xx -->
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="CMS32M57xx CMSIS-CORE">
			<!-- Cversion is necessary -->
			<description>System Startup for CMS CMS32M57xx Series</description>
			<!--RTE_Components_h>
                #define RTE_DEVICE_STARTUP_CMS32M57xx     /* Device Startup for CMS32M57xx */
            </RTE_Components_h-->
			<files>
				<!-- include folder -->
				<file category="include" name="Device/CMS32M57xx/Include/"/>
				<file category="header" name="Device/CMS32M57xx/Include/CMS32M57xx.h"/>
				<!-- startup files -->
				<file category="source" name="Device/CMS32M57xx/Source/ARM/startup_CMS32M57xx.s" attr="config" condition="Startup ARM" version="1.0.0"/>
				<!-- system file -->
				<file category="source" name="Device/CMS32M57xx/Source/system_CMS32M57xx.c" attr="config" version="1.0.0"/>
				<!-- device configuration required by drivers at the moment -->
			</files>
		</component>
        <!-- Startup CMS32MEBIKE -->
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="CMS32MEBIKE CMSIS-CORE">
            <!-- Cversion is necessary -->
            <description>System Startup for CMS CMS32MEBIKE Series</description>
            <!--RTE_Components_h>
                #define RTE_DEVICE_STARTUP_CMS32F035     /* Device Startup for CMS32F035 */
            </RTE_Components_h-->
            <files>
                <!-- include folder -->
                <file category="include" name="Device/CMS32MEBIKE/Include/"/>
                <file category="header" name="Device/CMS32MEBIKE/Include/CMS32MEBIKE.h"/>
                <!-- startup files -->
                <file category="source" name="Device/CMS32MEBIKE/Source/ARM/startup_CMS32MEBIKE.s" attr="config" condition="Startup ARM" version="1.0.0"/>
                <!-- system file -->
                <file category="source" name="Device/CMS32MEBIKE/Source/system_CMS32MEBIKE.c" attr="config" version="1.0.0"/>
                <!-- device configuration required by drivers at the moment -->
            </files>
        </component>
	</components>
</package>
